/* --- 実態 ---------------------------------------------------------------------------------------------------------- */
import { Post } from "../../../domain/Post";

/* --- リクエスト ------------------------------------------------------------------------------------------------------ */
import { FindPostListParams } from "../../request/post/FindPostListRequest";

interface PostRepository {

  /* --- 投稿一覧取得 -------------------------------------------------------------------------------------------------- */
  // findList(query: FindPostListParams) => Promise<>

  /* --- 投稿詳細取得 -------------------------------------------------------------------------------------------------- */
  find: (targetPostId: number) => Promise<Post>;
}


export { PostRepository };
